import '../model/model.dart';

class RecipeProvider {
  List<Recipe> getRecipes() {
    return [
      Recipe(
        'Маргарита',
        'assets/images/margarita.jpg',
        5,
        '''Інгредієнти:
        50 мл текіли
        30 мл апельсинового лікеру (наприклад, Cointreau)
        20 мл лимонного соку
        Лід
        Сіль для обрубки склянки

Приготування: Змочіть край склянки лимонним соком і обірвіть в сіль. Змішайте текілу, апельсиновий лікер і лимонний сік в шейкері з льодом. Потім процідіть у підготовлену склянку.''',
      ),
      Recipe(
        'Негроні',
        'assets/images/negroni.jpg',
        5,
        '''Інгредієнти:
    30 мл джину
    30 мл біттера Кампарі
    30 мл вермуту (наприклад, Martini Rosso)
    Апельсинова цедра або апельсиновий шматочок для гарніру
    Лід

Приготування:

    Наповніть келишок для коктейлю льодом.
    Додайте джин, біттер Кампарі і вермут у келишок.
    Помішайте інгредієнти ложкою.
    Виразьте апельсиновий шматочок над коктейлем так, щоб ароматний олійний спрій розповсюдився на поверхні напою, і додайте цедру або апельсиновий шматочок для гарніру.''',
      ),
      Recipe(
        'Космополітен',
        'assets/images/cosmopolitan.jpg',
        5,
        '''Інгредієнти:
        45 мл водки
        15 мл апельсинового лікеру (наприклад, Triple Sec)
        30 мл клюквеного соку
        15 мл лаймового соку
        Лід

Приготування: Змішайте всі інгредієнти в шейкері з льодом і процідіть у келишок для коктейлю.''',
      ),
      Recipe(
        'Піна Колада',
        'assets/images/pina-kolada.jpg',
        5,
        '''Інгредієнти:
        60 мл білої рому
        90 мл ананасового соку
        60 мл кокосового молока або кокосового крему
        Лід

Приготування: Змішайте всі інгредієнти в блендері з льодом та зберіть до однорідності. Подавайте зі стружкою кокоса або кількома шматочками ананаса.''',
      ),
      Recipe(
        'Мартіні',
        'assets/images/martini.jpg',
        3,
        '''Інгредієнти:
        60 мл джину
        15 мл вермуту
        Лід
        Оливки або лимонна цедра для гарніру

Приготування: Змішайте джин та вермут в келишку для мартіні з льодом. Перед подачею прикрасьте оливками або цедрою лимона.''',
      ),
      Recipe(
        'Мохіто',
        'assets/images/moxito.jpg',
        5,
        '''Інгредієнти:
        50 мл білої рому
        30 мл свіжого лаймового соку
        2 чайні ложки цукру
        6-8 м'яти листків
        Лід
        Содова вода

Приготування: В склянці розтрити м'яту з цукром і лаймовим соком. Додайте ром та лід. Завершіть напій содовою водою.''',
      ),
    ];
  }
}
